In [2]:
'''Problem: Utilize Pandas to analyze a dataset containing information about daily temperature recordings across different cities. 
The dataset includes columns: 'City', 'Date', and 'Temperature'. Write a Python script to:

Calculate the average temperature for each city.
Determine the city with the highest average temperature.
Find the date with the lowest recorded temperature across all cities.'''

"Problem: Utilize Pandas to analyze a dataset containing information about daily temperature recordings across different cities. \nThe dataset includes columns: 'City', 'Date', and 'Temperature'. Write a Python script to:\n\nCalculate the average temperature for each city.\nDetermine the city with the highest average temperature.\nFind the date with the lowest recorded temperature across all cities."

In [3]:
import pandas as pd

In [4]:
data = {
    'City': ['Nashik', 'Delhi', 'Bangalore', 'Hyderabad', 'Chennai','Surat','Pune','Delhi','Surat'],
    'Date':['01-02-2024','12-01-2024','01-03-2024','03-01-2024','04-01-2024','05-02-2024','07-03-2024','02-04-2024','04-02-2024'], 
    'Temperature': [30, 32, 28.5, 36, 44,20.5,38,45,28]
}
df = pd.DataFrame(data)
df.to_csv('temperature_data.csv', index=False)

In [5]:
data = pd.read_csv('temperature_data.csv')
data

        City        Date  Temperature
0     Nashik  01-02-2024         30.0
1      Delhi  12-01-2024         32.0
2  Bangalore  01-03-2024         28.5
3  Hyderabad  03-01-2024         36.0
4    Chennai  04-01-2024         44.0
5      Surat  05-02-2024         20.5
6       Pune  07-03-2024         38.0
7      Delhi  02-04-2024         45.0
8      Surat  04-02-2024         28.0

In [6]:
#Calculate the average temperature for each city.
average_temperature = data.groupby("City")["Temperature"].mean().reset_index()

In [7]:
average_temperature

        City  Temperature
0  Bangalore        28.50
1    Chennai        44.00
2      Delhi        38.50
3  Hyderabad        36.00
4     Nashik        30.00
5       Pune        38.00
6      Surat        24.25

In [10]:
#Determine the city with the highest average temperature.
highest_temp = average_temperature.max()
highest_temp

City           Surat
Temperature     44.0
dtype: object

In [9]:
#Find the date with the lowest recorded temperature across all cities.
lowest_temp = data.min().reset_index()
lowest_temp

         index           0
0         City   Bangalore
1         Date  01-02-2024
2  Temperature        20.5